** debug
#+BEGIN_SRC elisp :tangle no
  (message (concat lsp-dart-flutter-sdk-dir "\n" lsp-dart-sdk-dir "\n" dart-exec))
#+END_SRC

#+RESULTS:
: /home/frank/.flutter-sdk
: /nix/store/z1sraraxyzpw6wr0d7h0aaxcr6q2f10c-dart-2.14.3/
: /run/current-system/sw/bin/dart
